<?php


namespace bookLog\designModel;

/**
 * Class Chapter01
 * @package bookLog\designModel
 * 前言：
 *  构建可复用的设计模式。（灵活、优雅、复用性更好）
 *  不是解决所有的事情都要重头开始。可以借鉴已有成功的模式。
 * 1.1 什么是设计模式（模式的核心都在于提供了相关问题的解决方案）
 *  Christopher Alexander （建筑领域） ：
 *      每一个模式描述了一个我们周围不断发生的问题，以及该问题的解决核心。
 *      这样，你就能一次又一次地使用该方案而不是重复的劳动。
 *  模式的四个要素:
 *      模式名称(一般要求见名知意)[模式名可以帮助我们思考，便于我们与其他人交流设计思想及设计结果]、
 *      问题[描述了应该在何时使用模式]、
 *      解决方案[描述了设计的组成成分，它们之间的相互关系及各自的职责和协作方式]、
 *      效果[了模式应用的效果及使用模式应权衡的问题]。
 *  多维度:
 *      出发点的不同会产生对什么是模式和什么不是模式的理解不同
 *  应用:
 *      每一个设计模式都集中于一个特定的面向对象设计问题或设计要点，
 *      描述了什么时候使用它，
 *      在另一些设计约束条件下是否还能使用，以及使用的效果和如何取舍
 *  若我们采用过程式语言，可能就要包括诸如“继承”、“封装”和“多态”的设计模式
 *  但通常我们是以面向对象设计的
 *
 * 1.2 MVC的设计模式
 */
class Chapter01
{

}